tutorials/incompressible/icoDyMFoam/movingConeMotion/constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      dynamicMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

twoDMotion      yes;

dynamicFvMesh   dynamicMotionSolverFvMesh;

solver          laplace;

diffusivity     file;
// diffusivity     uniform;

frozenDiffusion off;

distancePatches
(
    movingWall
    farFieldMoving
);


// ************************************************************************* //
