tutorials/incompressible/icoDyMFoam/movingConeMotion/constant/polyMesh/blockMeshDict-fine
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.001;

vertices
(
    (-7.5 0 0)
    (-7 0 0)
    (-3.5 0 0)
    (0 0 0)
    (-7.5 0.75 -0.0327457)
    (-7 0.75 -0.0327457)
    (-3.5 2 -0.0873219)
    (0 2 -0.0873219)
    (-7.5 2.5 -0.109152)
    (-7 2.5 -0.109152)
    (-3.5 2.5 -0.109152)
    (0 2.5 -0.109152)
    (-7.5 0.75 0.0327457)
    (-7 0.75 0.0327457)
    (-3.5 2 0.0873219)
    (0 2 0.0873219)
    (-7.5 2.5 0.109152)
    (-7 2.5 0.109152)
    (-3.5 2.5 0.109152)
    (0 2.5 0.109152)
);

blocks
(
    hex (0 1 5 4 0 1 13 12) (15 15 1) simpleGrading (1 1 1)
    hex (2 3 7 6 2 3 15 14) (20 20 1) simpleGrading (2 0.25 1)
    hex (4 5 9 8 12 13 17 16) (15 15 1) simpleGrading (1 1 1)
    hex (5 6 10 9 13 14 18 17) (50 15 1) simpleGrading (1 1 1)
    hex (6 7 11 10 14 15 19 18) (20 15 1) simpleGrading (2 1 1)
);

edges
(
);

patches
(
    wall movingWall
    (
        (1 5 13 1)
        (5 6 14 13)
        (2 2 14 6)
    )
    patch farFieldMoving
    (
        (9 17 18 10)
    )
    wall fixedWall
    (
        (3 7 15 3)
        (7 11 19 15)
    )
    empty axis
    (
        (0 1 1 0)
        (2 3 3 2)
    )
    patch left
    (
        (0 0 12 4)
        (4 12 16 8)
    )
    patch farField
    (
        (8 16 17 9)
        (10 18 19 11)
    )
    wedge back
    (
        (0 4 5 1)
        (2 6 7 3)
        (4 8 9 5)
        (5 9 10 6)
        (6 10 11 7)
    )
    wedge front
    (
        (0 1 13 12)
        (2 3 15 14)
        (12 13 17 16)
        (13 14 18 17)
        (14 15 19 18)
    )
);

mergePatchPairs
(
);


// ************************************************************************* //
